Tekla.Structures.Model.Events
The Events class allows the user to register event listeners for model events.
Remarks:
Asynchronous event handling
Registered event handlers are called asynchronously so that many handlers may be running
simultaneously. Event handlers are not guaranteed to be run in the same thread where they were registered.
The asynchronous nature of the events requires the use of synchronization constructs on objects
and data structures that are not defined to be thread safe.
Microsoft's documentation about the lock statement: http://msdn.microsoft.com/en-us/library/c5kehkcz.aspx
Microsoft's documentation about delegates: http://msdn.microsoft.com/en-us/library/900fyy8e.aspx
Microsoft's documentation about managed threading: http://msdn.microsoft.com/en-us/library/1c9txz50.aspx
The following example shows how to make sure that only one selection event handler is running at a time.
using Tekla.Structures.Model;
public class Example
{
private Tekla.Structures.Model.Events _events = new Tekla.Structures.Model.Events();
private object _selectionEventHandlerLock = new object();
private object _changedObjectHandlerLock = new object();
public void RegisterEventHandler()
{
_events.SelectionChange += Events_SelectionChangeEvent;
_events.ModelObjectChanged += Events_ModelObjectChangedEvent;
_events.Register();
}
public void UnRegisterEventHandler()
{
_events.UnRegister();
}
void Events_SelectionChangeEvent()
{
/* Make sure that the inner code block is running synchronously */
lock(_selectionEventHandlerLock)
{
System.Console.WriteLine("Selection changed event received.");
}
}
void Events_ModelObjectChangedEvent(List<ChangeData> changes)
{
/* Make sure that the inner code block is running synchronously */
lock (_changedObjectHandlerLock)
{
foreach(ChangeData data in changes)
System.Console.WriteLine("Changed event received " + ":" + data.Object.ToString() + ":" + " Type" + ":" + data.Type.ToString() + " guid: " + data.Object.Identifier.GUID.ToString());
System.Console.WriteLine("Changed event received for " + changes.Count.ToString() + " objects");
}
}
}

Tekla.Structures.Model.Events.SelectionChange
The SelectionChange event is raised when the user changes the current selection inside Tekla Structures.

Tekla.Structures.Model.Events.AnnotationSelectionChange
The SelectionChange event is raised when the user changes the current selection of an annotation inside Tekla Structures.

Tekla.Structures.Model.Events.CommandStatusChange
The CommandStatusChange event is raised when a command is started/ended.

Tekla.Structures.Model.Events.TrackEvent


Tekla.Structures.Model.Events.PointInputChanged


Tekla.Structures.Model.Events.ModelSave
The ModelSave event is raised just after a model has been saved.
[Obsolete("Deprecated. Please use OnModelSaveInfo instead.", false)]

Tekla.Structures.Model.Events.ModelSaveInfo
The ModelSave event is raised just after a model has been saved with the model save information as a string parameter.

Tekla.Structures.Model.Events.ModelSaveAs
The ModelSaveAs event is raised just after a model has been saved using save as.

Tekla.Structures.Model.Events.ModelLoad
The ModelLoad event is raised just after a model has been loaded.

Tekla.Structures.Model.Events.ModelLoadInfo
These are several events, user mast part the event info string to know the event type, see Tekla.Structures.ModelInternal.EventHandler OnEvent function

Tekla.Structures.Model.Events.ModelUnloading
The ModelUnloading event is raised just before the model is unloaded.

Tekla.Structures.Model.Events.ModelUnloadingSync
The ModelUnloadingSync event is raised synchronously on the main thread just before the model is unloaded.
Use this event only when core resources need be cleaned up before the model unloading proceeds.
All UI-only related resource cleanup should be done in the async ModelUnloading event.
Tekla.Structures.Model.Events.OnModelUnloadingSync(System.String,System.Object[])

Tekla.Structures.Model.Events.Numbering
The Numbering event is raised just after a model has been numbered.

Tekla.Structures.Model.Events.ModelChanged
The ModelChanged event is raised just after some changes have been made to the model.
Note, this event is however not triggered when UNDO or REDO are performed.

Tekla.Structures.Model.Events.ModelObjectNumbered
The ModelObjectNumbered event is raised when model object is numbered.

Tekla.Structures.Model.Events.ModelObjectChanged
The ModelObjectChanged event is raised just after some changes have been made to the model objects.
Note, this event is triggered when UNDO or REDO are performed!!

Tekla.Structures.Model.Events.TeklaStructuresExit
The TeklaStructuresExit event is raised just before Tekla Structures exits. After this event has been called
the user will no longer be able to perform any calls to Tekla Structures.

Tekla.Structures.Model.Events.ClashCheckDone
The ClashCheckDone event is raised just after clash check is completed.

Tekla.Structures.Model.Events.ClashDetected
The ClashDetected event is raised just after the detection of each clash.
The clash information is saved before the event is triggered.

Tekla.Structures.Model.Events.Interrupted
Occurs when user interrupts.

Tekla.Structures.Model.Events.UndoClicked
Occurs when user clicks undo.

Tekla.Structures.Model.Events.ProjectInfoChanged
The ProjectInfoChanged event is raised just after some changes have been made to the project info.
Note, this event is however not triggered when UNDO or REDO are performed.

Tekla.Structures.Model.Events.ClipPlaneChanged
Occurs when user deletes a clip plane.

Tekla.Structures.Model.Events.ClipBoxChanged
Occurs when user deletes a clip box.

Tekla.Structures.Model.Events.HiddenObjectsChanged
Occurs when user hides an object or view is redrawn

Tekla.Structures.Model.Events.TemporaryStatesChanged
Occurs when temporary states are changed.

Tekla.Structures.Model.Events.ViewClosed
Occurs when view is closed.

Tekla.Structures.Model.Events.ViewOpened
Occurs when view is opened.

Tekla.Structures.Model.Events.ViewCreated
Occurs when view is created.

Tekla.Structures.Model.Events.ViewModified
Occurs when view is modified.

Tekla.Structures.Model.Events.ViewDeleted
Occurs when view is deleted.

Tekla.Structures.Model.Events.ModelViewDrawn
Occurs when view is drawn or redrawn.

Tekla.Structures.Model.Events.TsEventOccurred
Occurs when TS event occurs.

Tekla.Structures.Model.Events.viewCameraChangedHandler
Occurs when view camera changes.

Tekla.Structures.Model.Events.ViewCameraChanged
Occurs when view camera is changed.

Tekla.Structures.Model.Events.OnSelectionChange(System.String,System.Object[])


Tekla.Structures.Model.Events.OnAnnotationSelectionChange(System.String,System.Object[])


Tekla.Structures.Model.Events.OnCommandStatusChange(System.String,System.Object[])


Tekla.Structures.Model.Events.OnViewCameraChangedEvent(System.String,System.Object[])


Tekla.Structures.Model.Events.OnTrackEvent(System.String,System.Object[])


Tekla.Structures.Model.Events.OnPointInputChangedEvent(System.String,System.Object[])


Tekla.Structures.Model.Events.OnModelSave(System.String,System.Object[])
[Obsolete("Deprecated. Please use OnModelSaveInfo instead.", false)]

Tekla.Structures.Model.Events.OnModelSaveInfo(System.String,System.Object[])
Called when model is saved.
eventName: Name of the save event.
parameters: Event parameters. Contains the code which specifies the reason of the save action.

Tekla.Structures.Model.Events.OnModelSaveAs(System.String,System.Object[])


Tekla.Structures.Model.Events.OnModelLoad(System.String,System.Object[])


Tekla.Structures.Model.Events.OnModelLoadInfo(System.String,System.Object[])


Tekla.Structures.Model.Events.OnModelUnloading(System.String,System.Object[])


Tekla.Structures.Model.Events.OnModelUnloadingSync(System.String,System.Object[])


Tekla.Structures.Model.Events.OnNumbering(System.String,System.Object[])


Tekla.Structures.Model.Events.OnModelObjectNumbered(System.String,System.Object[])


Tekla.Structures.Model.Events.OnModelObjectChanged(System.String,System.Object[])


Tekla.Structures.Model.Events.OnDbCommit(System.String,System.Object[])


Tekla.Structures.Model.Events.OnTeklaStructuresExit(System.String,System.Object[])


Tekla.Structures.Model.Events.OnClashCheckDone(System.String,System.Object[])


Tekla.Structures.Model.Events.OnClashDetected(System.String,System.Object[])


Tekla.Structures.Model.Events.OnInterrupted
Called when uesr interrupts.

Tekla.Structures.Model.Events.OnUndoClicked
Called when user clicks undo.

Tekla.Structures.Model.Events.OnProjectInfoChanged(System.String,System.Object[])


Tekla.Structures.Model.Events.OnHiddenObjectsChanged


Tekla.Structures.Model.Events.OnTemporaryStatesChanged


Tekla.Structures.Model.Events.OnClipPlaneChanged(System.String,System.Object[])


Tekla.Structures.Model.Events.OnClipBoxChanged(System.String,System.Object[])


Tekla.Structures.Model.Events.OnViewClosed(System.Int32)


Tekla.Structures.Model.Events.OnViewOpened(System.Int32)


Tekla.Structures.Model.Events.OnViewCreated(System.Int32)


Tekla.Structures.Model.Events.OnViewModified(System.Int32)


Tekla.Structures.Model.Events.OnViewDeleted(System.Int32)


Tekla.Structures.Model.Events.OnModelViewDrawn(System.Int32)


Tekla.Structures.Model.Events.OnTsEventOccurred(System.String)


Tekla.Structures.Model.Events.InitializeLifetimeService
Initializes the lifetime service.
Returns: Always null.

Tekla.Structures.Model.Events.#ctor
Creates an empty events instance.

Tekla.Structures.Model.Events.Register
Registers the instance to listen to the specified events.
More event delegates should not be added without calling UnRegister
first.

Tekla.Structures.Model.Events.UnRegister
Unregisters the instance from listening to events.

Tekla.Structures.Model.Events.Dispose
Disposes the instance.

Tekla.Structures.Model.Events.Finalize
Finalizes the instance.